#+macro: module-summary (eval (org-export-string-as (concat "- [[file:" $1 ".org][" $1 "]] :: \n  #+include: " $1 ".org::module-summary\n") 'org t))
#+EXPORT_FILE_NAME: README.org

#+title: Elvish completions

This Elvish package contains various completions I and others have written for the [[https://elv.sh/][Elvish shell]].

* Compatibility

These modules are only guaranteed to be fully compatible with [[https://elv.sh/get/][Elvish HEAD]], which is what I use. This means that occasionally, they will not work even with the latest official release, when breaking changes are introduced. Since Elvish is in active development, I highly recommend you use the latest commit too.

* Installation and use

To install, use [[https://elvish.io/ref/epm.html][epm]]:

#+begin_src elvish
  use epm
  epm:install github.com/zzamboni/elvish-completions
#+end_src

For each module you want to use, you need to add the following to your =rc.elv= file:

#+begin_src elvish
  use github.com/zzamboni/elvish-completions/<modulename>
#+end_src

See each module's page for detailed usage instructions.

* Modules included

The following modules are included:

#+begin_src elvish :exports results :results drawer :eval export
ls *.org | egrep -v 'README|_template' | each [m]{ echo "{{{module-summary("(basename $m .org)")}}}" }
#+end_src

#+RESULTS:
:results:
{{{module-summary(builtins)}}}
{{{module-summary(cd)}}}
{{{module-summary(comp)}}}
{{{module-summary(dd)}}}
{{{module-summary(git)}}}
{{{module-summary(ssh)}}}
{{{module-summary(vcsh)}}}
:end:
